#include <iostream>

using namespace std;

int main()
{
	// К операторам сравнения относятся следующие операторы:
	// Равно	==
	// Не равно  !=
	// Больше  >
	// Меньше  <
	// Больше либо равно  >=
	// Меньше либо равно  <=

	int a, b;
	cout << "a\t|" << "b\t|" << "a == b\t|" << "a != b\t|" << "a > b\t|" << "a < b\t|"
		<< "a >= b\t|" << "a <= b\t|" << endl;
	cout << "-----------------------------------------------------------------" << endl;
	cout << boolalpha;
	a = 10;
	b = 10;
	cout << a << "\t|" << b << "\t|" << (a == b) << "\t|" << (a != b) << "\t|" << (a > b) 
		<< "\t|" << (a < b) << "\t|" << (a >= b) << "\t|" << (a <= b) << "\t|" << endl;

	a = 5;
	b = 10;
	cout << a << "\t|" << b << "\t|"  << (a == b) << "\t|" << (a != b) << "\t|" << (a > b) 
		 << "\t|" << (a < b) << "\t|" << (a >= b) << "\t|" << (a <= b) << "\t|" << endl;

	a = 10;
	b = 5;
	cout << a << "\t|" << b << "\t|"  << (a == b) << "\t|" << (a != b) << "\t|" << (a > b) 
		 << "\t|" << (a < b) << "\t|" << (a >= b) << "\t|" << (a <= b) << "\t|" << endl;

	return 0;
}